
# #4
# num1 = 10  
# academy = "Goal Oriented Academy"  

# name = 'Jumbera'
# name2 = 'mayvala'
# print(name2)  

# num = 30  
# print(str(num) + "20")  


# #5

# #  print() ფუნქცია:
# # გამოიყენება ეკრანზე ტექსტის ან ცვლადის მნიშვნელობის გამოსატანად.

# print("გამარჯობა, მსოფლიო!")  # ბეჭდავს ტექსტს

# age = 25
# print("შენი ასაკია:", age)  # ბეჭდავს ტექსტს + რიცხვს


# #  str() ფუნქცია:
# # ცვლის ნებისმიერ მნიშვნელობას სტრინგად (ტექსტად).

# number = 10
# text = str(number)  # აქ number ხდება "10" (სტრინგი)
# print("რიცხვი როგორც ტექსტი:", text)

# #  int() ფუნქცია:
# # სტრინგს ან სხვა ტიპის მონაცემს გარდაქმნის მთელ რიცხვად (integer).
# # გამოიყენება მაშინ, როცა მომხმარებლის მიერ შემოტანილი ტექსტი უნდა გადაიყვანო რიცხვად.

# user_input = input("შეიყვანე ასაკი: ")  # ვთქვათ, შეიყვანა "20"
# age = int(user_input)  # "20" გარდაიქმნება რიცხვად 20
# print("10 წლის შემდეგ შენ იქნები", age + 10)

# # მნიშვნელობა უნდა იყოს ნამდვილად რიცხვი, თორემ შეცდომას მისცემს: int("abc") → Error


# #  float() ფუნქცია:
# # გარდაქმნის სტრინგს ან რიცხვს ათწილადად (მცურავი წერტილით რიცხვად).

# price = float(input("შეიყვანე პროდუქტის ფასი: "))  # მაგალითად 5.99
# print("გადახდილი თანხა:", price)

# # float მუშაობს ისეთ რიცხვებზე, როგორიცაა: 3.14, 2.0, 0.99 და ა.შ.


# #6

# # ჩვენი საკუთარი სახელი
# my_name = "zaza"

# # ვთხოვოთ მომხმარებელს შეიყვანოს თავისი სახელი
# user_name = input("გთხოვ შეიყვანე შენი სახელი: ")

# # ვამოწმებთ ემთხვევა თუ არა სახელები
# if user_name == my_name:
#     print("ჩვენ ერთი და იგივე სახელი გვქვია! ")
# else:
#     print("შენ გქვია", user_name + ", მე კი ვარ", my_name)]



# #7
# text = input("შეიყვანე რაიმე ტექსტი: ")


# for i in range(10):
#     print(text)


#8

# name = input("შეიყვანე შენი სახელი: ")
# age = int(input("შეიყვანე შენი ასაკი): "))        
# height = float(input("შეიყვანე შენი სიმაღლე : "))   

# print("შენ გქვია " + name + ", შენ ხარ " + str(age) + " წლის და შენი სიმაღლეა " + str(height) + " მეტრი.")


#რაც არ დამიწერია 1-2-3 ეგენი  საკლასოში გვქონდა :)